## Thirawat Boonsang 63011357

In [1]:
# import libraries

import math
import numpy as np
import pandas as pd
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error
from sklearn.metrics import r2_score

In [2]:
# read dataset

df = pd.read_csv(r"C:\Users\thira\Documents\Math of data science\Salary.csv")

In [3]:
# display dataset

df

,Experience in year,Salary (kTHB),Unnamed: 2,Unnamed: 3,Unnamed: 4
0,4,45,NaN,NaN,Let's find:
1,5,55,NaN,NaN,Slope
2,20,80,NaN,NaN,Intercept
3,14,64,NaN,NaN,Mean squared error
4,32,100,NaN,NaN,Root mean squared error
5,22,90,NaN,NaN,R2 score
6,38,120,NaN,NaN,NaN
7,43,155,NaN,NaN,NaN

In [4]:
# display dataset information

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Experience in year  8 non-null      int64
 1   Salary (kTHB)       8 non-null      int64
 2   Unnamed: 2          0 non-null      float64
 3   Unnamed: 3          0 non-null      float64
 4   Unnamed: 4          6 non-null      object
dtypes: float64(2), int64(2), object(1)
memory usage: 448.0+ bytes

In [5]:
# display columns

df.head()

,Experience in year,Salary (kTHB),Unnamed: 2,Unnamed: 3,Unnamed: 4
0,4,45,NaN,NaN,Let's find:
1,5,55,NaN,NaN,Slope
2,20,80,NaN,NaN,Intercept
3,14,64,NaN,NaN,Mean squared error
4,32,100,NaN,NaN,Root mean squared error

In [6]:
df = df[['Experience in year', 'Salary (kTHB)']]
df.head()

   Experience in year  Salary (kTHB)
0                   4             45
1                   5             55
2                  20             80
3                  14             64
4                  32            100

In [7]:
X = df["Experience in year"].values.reshape(-1, 1)
y = df["Salary (kTHB)"].values.reshape(-1, 1)
reg = LinearRegression().fit(X, y)

In [8]:
y_pred = reg.predict(X)
y_pred

array([[ 44.39576988],
       [ 46.81928934],
       [ 83.17208122],
       [ 68.63096447],
       [112.25431472],
       [ 88.01912014],
       [126.79543147],
       [138.91302876]])

In [9]:
# Slope
slope = reg.coef_[0][0]
print(f"Slope = {str(slope)}\n")

# Intercept
inter = reg.intercept_[0]
print(f"Interpect = {str(inter)}\n")

# Mean Squared Error
m2_error = mean_squared_error(y, y_pred)
print(f"Mean Squared Error = {str(m2_error)}\n")

# Root Mean Squared Error
m2_error_root = mean_squared_error(y, y_pred, squared=False)
print(f"Root Mean Squared Error (RMS Error) = {str(m2_error_root)}\n")

# R2 Score
r2_score = r2_score(y, y_pred)
print(f"R2 score = {str(r2_score)}")

Slope = 2.423519458544839

Interpect = 34.70169204737733

Mean Squared Error = 69.73221235194589

Root Mean Squared Error (RMS Error) = 8.350581557708773

R2 score = 0.9395988253613689